Revit 2024 API
RebarShapeConstraint180DegreeBendArcLength Constructor
 Create a 180-degree bend constraint driven by arc length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public RebarShapeConstraint180DegreeBendArcLength(
	ElementId paramId
)
Visual Basic
Public Sub New ( _
	paramId As ElementId _
)
Visual C++
public:
RebarShapeConstraint180DegreeBendArcLength(
	ElementId^ paramId
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 The Id of a Rebar Shape parameter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  paramId is not a valid Element identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarShapeConstraint180DegreeBendArcLength Class
Autodesk.Revit.DB.Structure Namespace